{"backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 4], "bias_constraint": null, "trainable": true, "name": "dense_1", "units": 4, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "trainable": true, "name": "dense_2", "units": 6, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "trainable": true, "name": "dense_3", "units": 3, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}