{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "units": 4, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "name": "dense_1", "activation": "relu", "batch_input_shape": [null, 4], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "units": 6, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "units": 3, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential"}